<template>
  <div class="shadeWrapper" v-show="hide">
    <div class="shade">
    </div>
    <div class="userProtocol">
      <div class="userProtocol-header">
        <h3>用户协议</h3>
        <img src="./imgs/icon-gb@2x.png" alt="" @click="Return()">
      </div>
      <div class="content">
        <p><span style="font-weight:bold">甲方：</span> 康美药葫芦康美智慧药房平台（以下简称甲方<br/><span style="font-weight:bold">乙方：</span> 康美药葫芦康美智慧药房注册会员（以下简称乙方）</p>
        <p>根据《互联网药品信息服务管理办法》、《互联网药品交易服务管理办法》的有关规定，甲、乙双方在诚信的基础上，经友好协商，现就乙方使用甲方的购药网上平台进行药品网上交易的有关事宜达成一致，特订立本合同，以资共同遵守。</p>
        <p>康美药葫芦智慧药房是由康美药业股份有限公司康美智慧医药科技（深圳）有限公司创建的向个人消费者提供互联网药品交易服务的网站。下列条款适用于康美智慧药房药葫芦的用户，若您使用康美智慧药房药葫芦的服务，您必须同意此合同。</p>
        <h3>一、定义</h3>
        <p>1.1 供给方：康美智慧药房合作医院、实体药店、康美智慧药柜为乙方提供药品销售、药品配送、在线问医诊、用药咨询、药品销售、药品配送等服务</p>
        <p>1.2 甲方：指由康美药业股份有限公司康美智慧医药科技（深圳）有限公司负责开发并运营的康美智慧药房药葫芦平台。</p>
        <p>1.3 乙方：指有商品需求意向的或有专业医药咨询需求的或有商品需求意向的使用者。</p>
        <h3>二、双方权利和义务</h3>
        <p>（一）甲方的权利和义务</p>
        <p>1、甲方有义务在现有技术上维护整个网上交易平台的正常运行，并努力提升和改进技术，使乙方网上交易活动得以顺利进行。</p>
        <p>2、乙方在注册和使用甲方平台中所遇到的有关问题及反映的情况，甲方应及时做出回复。</p>
        <p>3、对于乙方在甲方平台上的不当行为或其它任何甲方认为应当终止服务的情况，甲方有权随时做出删除乙方账号、终止服务提供等处理，而无须征得乙方的同意。</p>
        <p>4、乙方因在甲方平台上发生购货交易而产生诉讼纠纷的，乙方通过司法部门或行政部门依照法定程序要求甲方提供相关数据，甲方应积极配合并提供有关资料。</p>
        <p>5、甲方有权对乙方的注册数据及交易行为进行查阅，发现注册数据或交易行为中存在任何问题或怀疑，均有权向乙方发出询问并做出相应处理。</p>
        <p>6、可使用权。乙方以此授予甲方独家的、全球通用的、永久的、免费的许可使用权利(并有权对该权利进行再授权)，使甲方有权(全部或部份部分地)使用、复制、修订、改写、发布、翻译、分发、执行和展示乙方公示于网站的各类信息或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。</p>
        <p>（二）乙方的权利和义务</p>
        <p>1、乙方有权利拥有自己在甲方的用户名及密码，并有权利使用自己的用户名及密码随时登陆甲方平台。乙方不得以任何形式擅自转让或授权他人使用自己的康美智慧药房药葫芦用户会员名。</p>
        <p>2、乙方有权根据本合同的规定以及甲方发布的相关规则，参加甲方的有关活动以及有权享受甲方提供的有关服务。</p>
        <p>3、乙方有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证甲 方可以通过上述联系方式与自己进行联系。同时，乙方也有义务在相关资料实际变更时及时更新有关注册资料。乙方保证不以他人资料在甲方进行注册或认证。</p>
        <p>4、乙方不应在甲方平台上恶意攻击甲方已登载的商品厂家，或采取不正当手段打击甲方的信誉。</p>
        <p>5、乙方在甲方平台不得发布各类违法或违规信息。</p>
        <p>6、乙方承诺自己在使用甲方提供的服务时实施的所有行为均遵守国家法律、法规和甲方的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，乙方将以自己的名义独立承担所有相应的法律责任。</p>
        <p>7、乙方同意，不对甲方上任何数据、商业信息擅自使用或者透露给第三方作商业性利用，包括但不限于在未经甲方事先书面批准的情况下，以复制、传播等方式使用在甲方网站站上展示的任何资料。</p>
        <h3>三、商品和服务方式</h3>
        <p>3.1、商品和服务的归属</p>
        <p>3.1.1、甲方所提供的相关实物商品所有权均属甲方。</p>
        <p>3.1.2、甲方所提供的相关信息服务，均属于甲方，同时负责保证在康美智慧药房药葫芦发布的相关信息符合国家有关法律法规。</p>
        <p>3.2、商品和服务的取得</p>
        <p>3.2.1、乙方可以在浏览康美智慧药房药葫芦后选购自己需要的商品，并按网站上所标示的方法购买商品或服务。相关细则详见“购物流程”。</p>
        <p>3.2.2、乙方若需要互联网信息服务的，可联系直接与在线客服部取得联系，咨询相关政策服务。</p>
        <h3>四、支付费用方式</h3>
        <p>乙方可以使用包括在线支付、银行汇款、货到付款等方式向甲方支付相关费用。</p>
        <h3>五、药品配送</h3>
        <p>5.1、药品发货时间</p>
        <p>甲方提供三种配送方式：药柜自提、药店速达达、商城配送仓库发货。甲方收到乙方款项后，供给方应按照乙方选择配送方式安排发货。如因仓库药品短缺不能按时发货的，甲方应与乙方联系，取得乙方同意延期发货后，订单进入延期发货状态。</p>
        <p>5.2、药品配送</p>
        <p>甲方为乙方提供第三方物流进行门对门的配送，甲方非工作日原则上不进行商业写字楼及政府机关等相关部门配送，除非乙方有要求的除外。</p>
        <h3>六、药品验货</h3>
        <p>乙方在收到药品时，签字确认前须对药品进行开箱检验，检验核实药品数量、药品包装是否完好、是否自己购买的药品，药品规格是否相符，药品外包装是否有甲方提供的专用防伪标贴。如其中一项不符合要求，乙方有权拒绝签字。如用户采用的是EMS等邮政系统配送方式，请签字后在配送人员面前进行药品上述条件的验收，如有不符合要求的，应让送货人员出具货物损毁证明，同时拨联系甲方客服进行确认，甲方应尽快安排第二次发货。</p>
        <h3>七、药品退换货</h3>
        <p>有关退货，甲方将在乙方收到药品起的7天内，符合下列药品退换货要求的，可以退货。</p>
        <p>1、由于产品本身存在质量原因，经甲方质量管理部门检验，确属质量问题的；</p>
        <p>2、由于甲方原因造成发货错误或因延误发货，而给乙方带来不便的；</p>
        <p>3、乙方因自身提供的地址不全或错误，使得商品未送达成功被退回的；</p>
        <p>4、 国家权威管理部门发布公告的产品（如停售、收回等）。</p>
        <p>对不具备下列条件的，甲方将不予退换货：</p>
        <p>1、在退换货之前乙方未与甲方客户服务中心取得联系；</p>
        <p>2、除非确有质量问题，否则甲方销售的商品包装一经拆封将不予退换；</p>
        <p>3、乙方购买的商品因非正常使用和储藏而出现质量问题的；</p>
        <p>4、低温贮藏商品、参茸制品、医用器械、成人用品除外；</p>
        <p>5、食物或液体溅落造成损坏；</p>
        <p>6、退回商品外包装或其他商品附属物不完整或有毁损；</p>
        <p>7、超出质量保证期的商品；</p>
        <p>8、所需退货商品的批号、型号与售出时不符的；</p>
        <p>9、不能提供甲方消费凭证的以及药品外包装没有甲方提供的防伪标贴的；</p>
        <p>10、商品并非由甲方提供的；</p>
        <p>11、不可抗力原因。</p>
        <h3>八、送货及费用</h3>
        <p>本站甲方将会把产品送到您所乙方指定的送货地址。所有在本站上甲方平台列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。送货费用根据您乙方选择的配送方式的不同而异。</p>
        <p>请清楚准确地填写您乙方的真实姓名、送货地址及联系方式。因如下情况造成订单延迟或无法配送等，甲方本站将不承担责任：</p>
        <p>（1）客户提供错误信息和不详细的地址；</p>
        <p>（2）货物送达无人签收，由此造成的重复配送所产生的费用及相关的后果。</p>
        <p>（3）不可抗力，例如：自然灾害、交通戒严、突发战争等。</p>
        <h3>九、会员隐私制度、账号安全性</h3>
        <p>尊重用户个人隐私是康美药葫芦智慧药房的一项基本政策。所以，作为对以上第二点用户注册资料分析的补充，康美药葫芦智慧药房一定不会在未经合法会员授权时公开、编辑或透露其注册资料及保存在康美药葫芦智慧药房中的非公开内容，除非有法律许可要求或康美药葫芦智慧药房在诚信的基础上认为透露这些信件在以下四种情况是必要的：</p>
        <p>(1)遵守有关法律规定，遵从康美智慧药房药葫芦合法服务程序。</p>
        <p>(2)保持维护康美智慧药房药葫芦的商标所有权。</p>
        <p>(3)在紧急情况下竭力维护会员个人和社会大众的隐私安全。</p>
        <p>(4)符合其他相关的要求。</p>
        <p>会员一旦注册成功，成为康美智慧药房药葫芦的合法会员，将得到一个密码和会员名。会员将对会员名和密码安全负全部责任。另外，每个会员都要对以其会员名进行的所有活动和事件负全责。会员若发现任何非法使用会员帐号或存在安全漏洞的情况，请立即告知康美智慧药房药葫芦客服。</p>
        <h3>十、会员管理</h3>
        <p>会员单独承担发布内容的责任。会员对服务的使用是根据所有适用于康美智慧药房药葫芦的国家法律、地方法律和国际法律标准的。会员必须遵循：</p>
        <p>(1)从中国境内向外传输技术性资料时必须符合中国有关法规。</p>
        <p>(2)使用网络服务不作非法用途。</p>
        <p>(3)不干扰或混乱网络服务。</p>
        <p>(4)遵守所有使用网络服务的网络协议、规定、程序和惯例。</p>
        <p>会员须承诺不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽等信息资料。另外，会员也不能传输任何教唆他人构成犯罪行为的资料；不能传输助长国内不利条件和涉及国家安全的资料；不能传输任何不符合当地法规、国家法律和国际法律的资料。未经许可而非法进入其它电脑系统是禁止的。若会员的行为不符合以上提到的服务条款，康美智慧药房药葫芦将作出独立判断立即取消会员服务帐号。会员需对自己在网上的行为承担法律责任。会员若在康美智慧药房药葫芦上散布和传播反动、色情或其他违反国家法律的信息，康美智慧药房药葫芦的系统记录有可能作为会员违反法律的证据。</p>
        <h3>十一、关于购买处方药</h3>
        <p>11.1、如果购买的药品没有“OTC”标记，则该药品为处方药，购买时请提供医疗机构医师开具的药房，并根据处方上的药品名称、规格、剂量进行购买，不得超量购买。</p>
        <p>11.2、处方开出当日有效，特殊情况下需要延长有效日期的，由开具处方的医师注明有效期限，但有效期最长不得超过3天。</p>
        <h3>十二、关于购买含麻黄碱的药品</h3>
        <p>12.1、购买含麻黄碱的药品，需要提供真实有效的身份证。</p>
        <p>12.2、如果含麻黄碱的药品为处方药，必须提供医疗机构医师开具的处方，购买数量限2个最小包装单位，并登记个人信息及联系方式。</p>
        <p>12.3、如果含麻黄碱药品为非处方药（含麻黄碱30mg以下）可不需提供处方，购买数量限2个最小包装单位，并登记个人信息及联系方式。</p>
        <h3>十三、责任限制</h3>
        <p>除了康美智慧药房药葫芦的使用条件中规定的其它限制和除外情况之外，在中国法律法规所允许的限度内，对于因会员帐号而引起的或与之有关的任何直接的、间接的、特殊的、附带的、后果性的或惩罚性的损害，或任何其它性质的损害，康美智慧药房药葫芦在任何情况下都不承担责任。康美智慧药房药葫芦不论是合同、保证、侵权（包括过失）项下的还是其他的责任，均不超过会员所购买的与该索赔有关的商品价值额。这些责任排除和限制条款将在法律所允许的限度内适用，并在会员资格被撤销或终止后仍继续有效。</p>
        <h3>十四、免责声明</h3>
        <p> 康美智慧药房药葫芦所提供的所有商品（包括药品、保健品等），由于均有一定的商品特殊性，因此任何用户不得将康美智慧药房药葫芦所提供的商品倒卖或用于不正当的用途，一经发现，立即交有关政府部门处理。</p>
        <p>网上药品交易服务一旦购买行为成立，除康美智慧药房药葫芦责任外（如产品质量问题）一律不得撤销。</p>
        <p>由于网络是开放性的，康美智慧药房药葫芦尽可能做到保证网络的安全性。但对于因不可抗力（如电信部门技术调整、黑客入侵、自然灾害、战争等）给用户造成的损失不负责。</p>
        <h3>十五、法律管辖和适用</h3>
        <p>本协议的订立、执行和解释及争议的解决均应适用中国法律。</p>
        <p>如发生本站服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对用户产生法律效力和影响。</p>
        <p>本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，该规定可被删除而其余条款应予以执行。</p>
        <p style="margin-top:20px">如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向本站甲方所在地有管辖权的人民法院提起诉讼。</p>
      </div>
      <div class="read">
        <span @click="Return()">已阅读</span>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      hide: 'false'
    };
  },
  methods: {
    Return() {
      this.$emit('handle');
    },
  }
};

</script>
<style lang="less" scoped>
@import '../../styles/mixin.less';
@color: #333;
.shadeWrapper {
  height: 100%;
  .shade {
    position: fixed;
    top: 0;
    left: 0;
    bottom: 0;
    right: 0;
    background: rgba(0, 0, 0, 0.4);
    z-index: 9;
  }
  .userProtocol {
    width: 90%;
    height: 85%;
    background-color: #ffffff;
    border-radius: 7px;
    position: absolute;
    left: 0;
    top: 0;
    right: 0;
    bottom: 0;
    margin: auto;
    z-index: 10;
    padding-bottom: 60px;
    .userProtocol-header {
      position: relative;
      height: 52px;
      h3 {
        height: 52px;
        line-height: 52px;
        color: @color;
        font-size: 18px;
        text-align: center;
      }
      img {
        position: absolute;
        right: 10px;
        top: 10px;
        width: 24px;
        height: 24px;
      }
    }
    .content {
      text-align: left;
      position: absolute;
      top: 52px;
      left: 0;
      right: 0;
      bottom: 60px;
      padding: 0 14px;
      color: @color;
      overflow: auto;
      h3{
        font-weight: bold;
        line-height: 30px;
        font-size: 15px;
      }
      p {
        // text-indent: 2em;
        font-size: 15px;
        line-height: 24px;
      }
    }
    .read {
      width: 100%;
      position: absolute;
      bottom: 60px;
      background-color: #fff;
      span {
        display: block;
        width: 79px;
        height: 30px;
        text-align: center;
        line-height: 30px;
        border-radius: 3px;
        border: solid 1px @green-color;
        position: absolute;
        left: 50%;
        top: 16px;
        margin-left: -39px;
        color: @green-color;
        font-size: 15px;
      }
    }
  }
}

</style>
